BaseKinoteatr/src/Documents/ПродажаБилетов/ПродажаБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаБилетов</name>
  <attributes>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </attributes>
  <attributes>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСеанса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеанс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБронирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСеанса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кинозал</name>
    <type>
      <types>CatalogRef.Кинозалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБронирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКодПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СеансБронирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Билеты</name>
    <attributes>
      <name>РядМесто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BaseKinoteatr/src/Documents/ПродажаБилетов/ManagerModule.bsl
Процедура ПечатьБилета(Стр, ТабДок, Сеанс) Экспорт
	
	ДанныеСеанса = Кино.ПолучитьДанныеСеанса(Сеанс);
	
	//если строка из которой будем получать данных определена,
	//то получаем области, заполняем параметры областей и выводим в табличный документ
	Если Стр <> Неопределено Тогда        		
		Макет = Документы.ПродажаБилетов.ПолучитьМакет("Билет");
		ОблКартинка = Макет.ПолучитьОбласть("Картинка");
		ОблКартинка.Параметры.Кинотеатр = ДанныеСеанса.Кинотеатр;
		ОблКартинка.Параметры.Фильм = ВРег(ДанныеСеанса.Фильм);
		ОблКартинка.Параметры.Зал = ДанныеСеанса.Кинозал;
		ОблКартинка.Параметры.Цена = Стр.Цена;
		ОблКартинка.Параметры.Ряд = Сред(Стр.Место, 1, Найти(Стр.Место, "|") - 1);
		ОблКартинка.Параметры.Место = Сред(Стр.Место, Найти(Стр.Место, "|") + 1, СтрДлина(Стр.Место) - Найти(Стр.Место, "|"));
		ОблКартинка.Параметры.Сеанс = Формат(Дата(ДанныеСеанса.ВремяСеанса), "ДФ=HH:mm");
		ОблКартинка.Параметры.День = Формат(Стр.День, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОблКартинка);
		
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.ОтображатьСетку = Ложь;
		
	
	КонецЕсли;
	
КонецПроцедуры
